test/integration/helpers/fixtures/batch-create.json

[
    {
        "scope": "https://api.trolley.com:443",
        "method": "POST",
        "path": "/v1/batches",
        "body": {
            "sourceCurrency": "USD",
            "description": "Integration Test Create",
            "payments": []
        },
        "status": 200,
        "response": {
            "ok": true,
            "batch": {
                "id": "B-WBoHkSeJXusj4wQj4N7o5Q",
                "status": "open",
                "tags": [],
                "amount": "0.00",
                "currency": "USD",
                "totalPayments": 0,
                "description": "Integration Test Create",
                "sentAt": null,
                "completedAt": null,
                "createdAt": "2023-09-26T22:53:05.306Z",
                "updatedAt": "2023-09-26T22:53:05.318Z",
                "quoteExpiredAt": null,
                "payments": {
                    "payments": [],
                    "meta": {
                        "page": 1,
                        "pages": 0,
                        "records": 0
                    }
                }
            }
        },
        "rawHeaders": [
            "Date",
            "Tue, 26 Sep 2023 22:53:05 GMT",
            "Content-Type",
            "application/json; charset=utf-8",
            "Content-Length",
            "370",
            "Connection",
            "close",
            "Cache-Control",
            "no-store, no-cache",
            "Content-Security-Policy",
            "default-src 'self';base-uri 'self';block-all-mixed-content;font-src 'self' https: data:;frame-ancestors 'self';img-src 'self' data:;object-src 'none';script-src 'self';script-src-attr 'none';style-src 'self' https: 'unsafe-inline';upgrade-insecure-requests",
            "X-DNS-Prefetch-Control",
            "off",
            "Expect-CT",
            "max-age=0",
            "Strict-Transport-Security",
            "max-age=15552000; includeSubDomains",
            "X-Download-Options",
            "noopen",
            "X-Content-Type-Options",
            "nosniff",
            "X-Permitted-Cross-Domain-Policies",
            "none",
            "Referrer-Policy",
            "no-referrer",
            "X-XSS-Protection",
            "0",
            "Access-Control-Allow-Origin",
            "*",
            "X-Rate-Limit-Limit",
            "600",
            "X-Rate-Limit-Remaining",
            "599",
            "X-Rate-Limit-Reset",
            "1695768845",
            "Vary",
            "Origin",
            "ETag",
            "W/\"172-2dfGD+hYhjQLf8NoyGCNPOzV088\""
        ],
        "responseIsBinary": false
    },
    {
        "scope": "https://api.trolley.com:443",
        "method": "GET",
        "path": "/v1/batches",
        "body": "",
        "status": 200,
        "response": {
            "ok": true,
            "batches": [
                {
                    "id": "B-WBoHkSeJXusj4wQj4N7o5Q",
                    "status": "open",
                    "tags": [],
                    "amount": "0.00",
                    "currency": "USD",
                    "totalPayments": 0,
                    "description": "Integration Test Create",
                    "sentAt": null,
                    "completedAt": null,
                    "createdAt": "2023-09-26T22:53:05.306Z",
                    "updatedAt": "2023-09-26T22:53:05.318Z",
                    "quoteExpiredAt": null
                },
                {
                    "id": "B-P6B8S1FA6uyqyGci2kkjjy",
                    "status": "complete",
                    "tags": [],
                    "amount": "12.00",
                    "currency": "CAD",
                    "totalPayments": 1,
                    "description": "Payouts on 31 Aug 2023 #81",
                    "sentAt": "2023-08-31T02:30:54.942Z",
                    "completedAt": "2023-08-31T02:31:06.934Z",
                    "createdAt": "2023-08-31T02:24:03.549Z",
                    "updatedAt": "2023-08-31T02:31:06.940Z",
                    "quoteExpiredAt": "2023-08-31T04:24:25.951Z"
                },
                {
                    "id": "B-WoMqMw2QJKGDA2GPAddBdz",
                    "status": "failed",
                    "tags": [],
                    "amount": "102.00",
                    "currency": "CAD",
                    "totalPayments": 1,
                    "description": "Payouts on 17 Aug 2023 #932",
                    "sentAt": "2023-08-17T20:28:55.887Z",
                    "completedAt": "2023-08-17T20:29:07.947Z",
                    "createdAt": "2023-08-17T20:27:30.621Z",
                    "updatedAt": "2023-08-17T20:29:07.950Z",
                    "quoteExpiredAt": "2023-08-17T22:27:45.614Z"
                },
                {
                    "id": "B-DBW2NwsHdJ2nAJ4noUF5kf",
                    "status": "complete",
                    "tags": [],
                    "amount": "102.00",
                    "currency": "CAD",
                    "totalPayments": 1,
                    "description": "Payouts on 17 Aug 2023 #624",
                    "sentAt": "2023-08-17T19:42:05.063Z",
                    "completedAt": "2023-08-17T19:42:42.612Z",
                    "createdAt": "2023-08-17T17:10:30.929Z",
                    "updatedAt": "2023-08-17T19:42:42.624Z",
                    "quoteExpiredAt": "2023-08-17T21:27:20.152Z"
                },
                {
                    "id": "B-QLTy3oXNvvgDv6Qq8HffrY",
                    "status": "open",
                    "tags": [],
                    "amount": "12.00",
                    "currency": "USD",
                    "totalPayments": 1,
                    "description": "Integration Test Create",
                    "sentAt": null,
                    "completedAt": null,
                    "createdAt": "2023-08-09T00:29:13.051Z",
                    "updatedAt": "2023-08-09T00:29:14.761Z",
                    "quoteExpiredAt": null
                },
                {
                    "id": "B-QmoMmcUtHNH2od8jetWvhq",
                    "status": "open",
                    "tags": [],
                    "amount": "0.00",
                    "currency": "USD",
                    "totalPayments": 0,
                    "description": "Integration Test Create",
                    "sentAt": null,
                    "completedAt": null,
                    "createdAt": "2023-08-09T00:29:08.203Z",
                    "updatedAt": "2023-08-09T00:29:12.474Z",
                    "quoteExpiredAt": null
                },
                {
                    "id": "B-ShXHjvLyUrn9VcRRkYvaFd",
                    "status": "open",
                    "tags": [],
                    "amount": "2.00",
                    "currency": "CAD",
                    "totalPayments": 1,
                    "description": "Payouts on 8 Aug 2023 #79",
                    "sentAt": null,
                    "completedAt": null,
                    "createdAt": "2023-08-08T02:28:19.618Z",
                    "updatedAt": "2023-08-08T02:28:19.726Z",
                    "quoteExpiredAt": null
                },
                {
                    "id": "B-62aL9ieSp7fGzQCyCMtDSY",
                    "status": "open",
                    "tags": [],
                    "amount": "0.00",
                    "currency": "CAD",
                    "totalPayments": 0,
                    "description": "Payouts on 8 Aug 2023 #78",
                    "sentAt": null,
                    "completedAt": null,
                    "createdAt": "2023-08-08T02:24:59.259Z",
                    "updatedAt": "2023-08-08T02:24:59.259Z",
                    "quoteExpiredAt": null
                },
                {
                    "id": "B-EUw2QVdUAEeCv8yqnzpvWa",
                    "status": "open",
                    "tags": [],
                    "amount": "12.00",
                    "currency": "USD",
                    "totalPayments": 1,
                    "description": "Integration Test Create",
                    "sentAt": null,
                    "completedAt": null,
                    "createdAt": "2023-07-18T04:14:13.341Z",
                    "updatedAt": "2023-07-18T04:14:14.588Z",
                    "quoteExpiredAt": null
                },
                {
                    "id": "B-2Q425Br1KqgXGYFpQaBpFd",
                    "status": "open",
                    "tags": [],
                    "amount": "0.00",
                    "currency": "USD",
                    "totalPayments": 0,
                    "description": "Integration Test Create",
                    "sentAt": null,
                    "completedAt": null,
                    "createdAt": "2023-07-18T04:14:10.219Z",
                    "updatedAt": "2023-07-18T04:14:13.010Z",
                    "quoteExpiredAt": null
                }
            ],
            "meta": {
                "page": 1,
                "pages": 29,
                "records": 289
            }
        },
        "rawHeaders": [
            "Date",
            "Tue, 26 Sep 2023 22:53:05 GMT",
            "Content-Type",
            "application/json; charset=utf-8",
            "Content-Length",
            "3136",
            "Connection",
            "close",
            "Cache-Control",
            "no-store, no-cache",
            "Content-Security-Policy",
            "default-src 'self';base-uri 'self';block-all-mixed-content;font-src 'self' https: data:;frame-ancestors 'self';img-src 'self' data:;object-src 'none';script-src 'self';script-src-attr 'none';style-src 'self' https: 'unsafe-inline';upgrade-insecure-requests",
            "X-DNS-Prefetch-Control",
            "off",
            "Expect-CT",
            "max-age=0",
            "Strict-Transport-Security",
            "max-age=15552000; includeSubDomains",
            "X-Download-Options",
            "noopen",
            "X-Content-Type-Options",
            "nosniff",
            "X-Permitted-Cross-Domain-Policies",
            "none",
            "Referrer-Policy",
            "no-referrer",
            "X-XSS-Protection",
            "0",
            "Access-Control-Allow-Origin",
            "*",
            "X-Rate-Limit-Limit",
            "600",
            "X-Rate-Limit-Remaining",
            "598",
            "X-Rate-Limit-Reset",
            "1695768845",
            "Vary",
            "Origin",
            "ETag",
            "W/\"c40-jN40Njw9BzG3j3XWR7k+1Ahm2zQ\""
        ],
        "responseIsBinary": false
    }
]